TaylorGreenVortex/system/include/isoSurfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
|                                                                             |
| This file was automatically generated using the OpenFOAMCaseGenerator       |
| see https://github.com/tomrobin-teschner/OpenFOAMCaseGenerator              |
|                                                                             |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampling;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


isoSurface_Q
{
    type                  surfaces;
    libs                  (sampling);

    interpolationScheme   cellPoint;

    surfaceFormat         vtk;

    writeControl          writeTime;

    log                   no;

    surfaces
    {
        isoSurface_Q
        {
            type          isoSurface;
            isoField      Q;
            isoValue      0.1;
            interpolate   true;
        }
    }

    fields
    (
        Q
        p
    );
}

// ************************************************************************* //
